InformationRegisters/ЛБ_АнкетаЗалогодателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_АнкетаЗалогодателя</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОформленияАнкеты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипФизЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорииФизЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФинансовоеПоложениеСтабильное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеловаяРепутацияПоложительная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникПроисхожденияИмущества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ИсточникиПроисхожденияИмущества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникПроисхожденияИмуществаИной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактерОтношений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникПроисхожденияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ИсточникиПроисхожденияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникПроисхожденияДенежныхСредствИной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньРиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗалогодательБенефициарныйВладелец</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяИПДЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияКлиентаИПДЛ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_КатегорииИПДЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопИнформацияИПДЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьИПДЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботодательИПДЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешениеИПДЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДЛПМО_РДПЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияДЛПМО_РДПЛ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_КатегорииДЛПМО_РДПЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопИнформацияДЛПМО_РДПЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьДЛПМО_РДПЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботодательДЛПМО_РДПЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешениеДЛПМО_РДПЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственноеЛицоИПДЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственноеЛицоДЛПМО_РДПЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыДокументовЗалогодателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДокументовЗалогодателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументУдостоверяющийПравоПребыванияРФ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОперацияПоЗалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОперацияПоЗалогу</Name>
			<Comment>Виды операций документа "Операция по залогу"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Выдача займа под залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзъятиеОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПереоформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановкаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиСОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзъятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВозвратаИзъятого</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОстановкиНачисленияПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ПоискЗалогодателя/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьТекщиеСтроки()
	Если НЕ Залогодатели.Количество() = 0  Тогда
	    СтрокаЗ = Залогодатели[0]; 
		ИдентификаторСтрокиЗ = СтрокаЗ.ПолучитьИдентификатор();
		Элементы.Залогодатели.ТекущаяСтрока = ИдентификаторСтрокиЗ;
		
		ОтборДок = Новый Структура;
		ОтборДок.Вставить("Залогодатель", СтрокаЗ.Залогодатель);
		Строки = ДокументыЗалогодателей.НайтиСтроки(ОтборДок);
		Если НЕ Строки.Количество() = 0 Тогда
			СтрокаД = ДокументыЗалогодателей[0]; 
			ИдентификаторСтрокиД = СтрокаД.ПолучитьИдентификатор();
			Элементы.ДокументыЗалогодателей.ТекущаяСтрока = ИдентификаторСтрокиД;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если СтрДлина(Текст) > 2 Тогда
		ФИО = Текст;
        НайтиВозможныеВариантыЗалогодатели(); 
	ИначеЕсли СтрДлина(Текст) = 0 Тогда	 
		ФИО = Текст;
		Залогодатели.Очистить();
		ДокументыЗалогодателей.Очистить();	
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодателиПриАктивизацииСтроки(Элемент)
	//Возврат;	//+++ Моисеев пока что отключил.
	ТекСтрока = Элемент.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		ПерезаполнитьИнформациюПоДокументамЗалогодателя(ТекСтрока.Залогодатель);
		Элементы.ДокументыЗалогодателей.ОтборСтрок = Новый ФиксированнаяСтруктура("Залогодатель", ТекСтрока.Залогодатель);
		//Гражданство = ТекСтрока.Гражданство;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтрокуЗалогодателей(Залогодатель)
	Для каждого СтрокаЗ Из Залогодатели Цикл
		Если СтрокаЗ.Залогодатель = Залогодатель Тогда
		    ИдентификаторСтроки = СтрокаЗ.ПолучитьИдентификатор();
		    Элементы.Залогодатели.ТекущаяСтрока = ИдентификаторСтроки;
			Элементы.ДокументыЗалогодателей.ОтборСтрок = Новый ФиксированнаяСтруктура("Залогодатель", Залогодатель);
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Функция ПроверитьНачалоРаботыСКлиентом(Залогодатель)  
	Запрос = новый Запрос;  
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛБ_АнкетаЗалогодателя.Период КАК Период,
	               |	ЛБ_АнкетаЗалогодателя.ДатаОформленияАнкеты КАК ДатаОформленияАнкеты
	               |ИЗ
	               |	РегистрСведений.ЛБ_АнкетаЗалогодателя КАК ЛБ_АнкетаЗалогодателя
	               |ГДЕ
	               |	ЛБ_АнкетаЗалогодателя.Залогодатель = &Залогодатель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда  
		Если ДатаДок < Выборка.ДатаОформленияАнкеты тогда
			ОбщегоНазначения.СообщитьПользователю("Анкета клиента клиента оформлена " + Формат(Выборка.ДатаОформленияАнкеты, "ДФ=dd.MM.yyyy") + ". Подбор данных клиента на " + Формат(ДатаДок, "ДФ=dd.MM.yyyy; ДЛФ=DT") + " невозможен.");
			Возврат ложь;			
		КонецЕсли;	
	КонецЕсли;
	возврат Истина;
КонецФункции
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Дата") Тогда 
		ДатаДок = Параметры.Дата; 
		Если Параметры.Свойство("НаТекущуюДату") Тогда
			НаТекущуюДату = Параметры.НаТекущуюДату;
		КонецЕсли;	
	Иначе
		ДатаДок = ТекущаяДата(); 
		НаТекущуюДату = Истина;
	КонецЕсли;
	Если Параметры.Свойство("Залогодатель") Тогда  
		Если ПроверитьНачалоРаботыСКлиентом(Параметры.Залогодатель) Тогда			
			НоваяСтр = Залогодатели.Добавить();
			НоваяСтр.Залогодатель = Параметры.Залогодатель;
			Если Параметры.Свойство("НомерТелефона") Тогда
				НоваяСтр.НомерТелефона = Параметры.НомерТелефона;
			КонецЕсли;	
			Если Параметры.Свойство("Гражданство") Тогда
				Гражданство = Параметры.Гражданство;
			КонецЕсли;
			ФИО = СокрЛП(Параметры.Залогодатель); 
			НайтиВозможныеВариантыЗалогодатели();
			ЗаполнитьИнформациюПоДокументамЗалогодателя();	
			УстановитьТекущуюСтрокуЗалогодателей(Параметры.Залогодатель); 
			Элементы.КнопкаСоздать.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Гражданство) Тогда
	//	Гражданство = Справочники.СтраныМира.Россия;
	//КонецЕсли;
	Если Параметры.Свойство("ЭтоПредставитель") Тогда
		ЭтаФорма.Заголовок = "Выбор представителя клиента";
	КонецЕсли;
	Если Параметры.Свойство("ТолькоДокументы") Тогда
		Если Параметры.ТолькоДокументы Тогда
		    Элементы.ГруппыОтборы.Видимость = Ложь;
		КонецЕсли;	
	КонецЕсли;
	// ++ Сербаев 20.06.2023
	Если Параметры.Свойство("ВидОперации") Тогда
		ВидОперации = Параметры.ВидОперации;
	КонецЕсли;	
    // -- Сербаев 20.06.2023 
	Если Параметры.Свойство("БезДокументов") Тогда
		БезДокументов = Параметры.БезДокументов;
	КонецЕсли;
	Если Параметры.Свойство("НеРедактировать") Тогда
		Элементы.КнопкаСоздать.Доступность = Ложь; 
		Элементы.ИзменитьЗалогодателя.Доступность = Ложь;
	КонецЕсли;
	
	текущаяГруппаОтбора = "ОтборФИО_ДР";	//"ОтборНомерЗБ";

    //lion
	Если Этаформа.параметры.свойство("ОткрытьКарточкуНеОбрабатыватьВыбор") тогда
		Этаформа.ЗакрыватьПриВыборе=Ложь;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Функция ПроверитьБлокировкуКлиента(Клиент) 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей КАК ЛБ_КонтактнаяИнформацияЗалогодателей
	               |ГДЕ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.Залогодатель = &Залогодатель";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораЗалогодателя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	Если НаТекущуюДату Тогда
	    ДатаДок = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли;	
	Если Параметры.Свойство("Гражданство") Тогда
		Гражданство = Параметры.Гражданство;
	Иначе
		Гражданство = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
	КонецЕсли; 
	
	//проверим снятие блокировки с конт. информации клиента
	//Пока Истина Цикл
	//	Если НЕ ПроверитьБлокировкуКлиента(Результат.Залогодатель) Тогда    
	//		ДатаДок = ОбщегоНазначенияКлиент.ДатаСеанса();
	//		Прервать;
	//	КонецЕсли;	
	//Конеццикла;
	
    ФИО = СокрЛП(Результат.Залогодатель);
	НайтиВозможныеВариантыЗалогодатели();
	ЗаполнитьИнформациюПоДокументамЗалогодателя();
	УстановитьТекущуюСтрокуЗалогодателей(Результат.Залогодатель);
	ОчиститьПоляОтбора();
	//Этаформа.Закрыть(Результат);
КонецПроцедуры
                                                                                
&НаКлиенте
Процедура СоздатьЗалогодателя(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалогодателя",ЭтаФорма);    
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриСохранении", Истина);
	ОчиститьПоляОтбора();
	Залогодатели.Очистить();
	ДокументыЗалогодателей.Очистить();
	ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура НайтиВозможныеВариантыЗалогодатели()
	Залогодатели.Очистить();
	ДокументыЗалогодателей.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Залогодатели.Ссылка КАК Залогодатель,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК НомерТелефона,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ВЫБОР
	               |		КОГДА ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА -1
	               |		КОГДА МЕСЯЦ(&Дата) < МЕСЯЦ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |			ТОГДА РАЗНОСТЬДАТ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения, &Дата, ГОД) - 1
	               |		КОГДА МЕСЯЦ(&Дата) > МЕСЯЦ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |			ТОГДА РАЗНОСТЬДАТ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения, &Дата, ГОД)
	               |		КОГДА МЕСЯЦ(&Дата) = МЕСЯЦ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ДЕНЬ(&Дата) < ДЕНЬ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |						ТОГДА РАЗНОСТЬДАТ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения, &Дата, ГОД) - 1
	               |					КОГДА ДЕНЬ(&Дата) >= ДЕНЬ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |						ТОГДА РАЗНОСТЬДАТ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения, &Дата, ГОД)
	               |				КОНЕЦ
	               |	КОНЕЦ КАК ЗалогодательВозраст,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
				   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПервых.ОтветственныйЛомбард.НомерЛомбарда КАК ЗалогодательНомерЛомбардаГдеСозданаКарточка
	               |ИЗ
	               |	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	               |		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПервых КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПервых
					|		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПервых.Залогодатель = ЛБ_Залогодатели.Ссылка)
	               |ГДЕ
	               |	(ЛБ_Залогодатели.Наименование ПОДОБНО &Фио
	               |			ИЛИ &Фио = """")
	               |	И НЕ ЛБ_Залогодатели.ПометкаУдаления";

	//Запрос.УстановитьПараметр("Фио", "%"+Фио+"%");
	Запрос.УстановитьПараметр("Фио", Фио+"%");  
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Залогодатели.Загрузить(Запрос.Выполнить().Выгрузить());

	Если Залогодатели.Количество() <> 0 Тогда
		ЗаполнитьИнформациюПоДокументамЗалогодателя();
		УстановитьТекщиеСтроки();
	Иначе
		
		Сообщить("Залогодатели не найдены!");
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюПоДокументамЗалогодателя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец КАК Залогодатель,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК Серия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ КАК ОсновнойДУЛ,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен КАК НеДействителен
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			ДокументЗалогодателя.Владелец В (&Залогодатели)
	               |				И ВидДокументаЗалогодателя = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность)) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";	
	СписокЗалогодателей = Новый СписокЗначений;
	ТаблицаЗалогодателей = Залогодатели.Выгрузить(, "Залогодатель");
	Для каждого Стр Из ТаблицаЗалогодателей Цикл 
		СписокЗалогодателей.Добавить(Стр.Залогодатель);
	КонецЦикла;	     
	Запрос.УстановитьПараметр("Залогодатели", СписокЗалогодателей);
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	
	ДокументыЗалогодателей.Загрузить(Запрос.Выполнить().Выгрузить());
	ПроверитьДействительностьДокументов();
	ДокументыЗалогодателей.Сортировать("ОсновнойДУЛ УБЫВ"); 
КонецПроцедуры	  

&НаСервере
Процедура ПроверитьДействительностьДокументов() 
	ЕстьСвидетельствоОРождении = ложь;
	Для каждого Стр Из ДокументыЗалогодателей Цикл 
		Если Стр.ПроверкаНеДействителен Тогда  
			Продолжить;
		КонецЕсли;	
		Если Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
			Парам = Новый Структура("Серия, Номер", СокрЛП(Стр.Серия), СокрЛП(Стр.Номер));
			Если ЛБ_ОбменLX.ПаспортНедействителен(Парам) Тогда 
				Стр.ПроверкаНеДействителен = Истина;
			КонецЕсли;	
		КонецЕсли;	

		Если (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) Тогда
			ЕстьСвидетельствоОРождении = Истина;	
		КонецЕсли;
		Отбор = Новый Структура;
	    Отбор.Вставить("Залогодатель", Стр.Залогодатель);
        СтрокиЗ = Залогодатели.НайтиСтроки(Отбор);
		Если НЕ СтрокиЗ.Количество() = 0 Тогда
			ДатаРождения = СтрокиЗ.Получить(0).ДатаРождения;
			Если НЕ ДатаРождения = Дата(1,1,1) Тогда
		        ЛБ_ОбщийМодуль.ПроверитьДействительностьДокумента(Стр, ДатаРождения, Ложь, ДатаДок);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Если ЕстьСвидетельствоОРождении Тогда
		//проверим недействительность свидетельства о рождении если есть паспорт
        ЛБ_ОбщийМодуль.ПроверитьДействительностьСвидетельствоОРождении(ДокументыЗалогодателей);
	КонецЕсли;	
	
	//УдСтроки = новый СписокЗначений;
	//Для каждого Стр Из ДокументыЗалогодателей Цикл
	//	Если Стр.ПроверкаНеДействителен тогда
	//		Удстроки.Добавить(Стр); 
	//	КонецЕсли;	
	//Конеццикла;	  
	//Для каждого Эл Из УдСтроки Цикл 
	//	ДокументыЗалогодателей.Удалить(Эл.Значение);
	//КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура НайтиВозможныеВариантыДокументы()
	ДокументыЗалогодателей.Очистить();
	ЗалогоДатели.Очистить();    

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец КАК Залогодатель,
				   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя,
				   |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента, 
				   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ КАК ОсновнойДУЛ,
				   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК Серия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер,
				   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
				   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен КАК ПроверкаНеДействителен
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			&Дата,	               
	               |			 ВидДокументаЗалогодателя = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность)
	               |				И (ДокументСерия ПОДОБНО &Серия
	               |					ИЛИ &Серия = """")
	               |				И (ДокументНомер ПОДОБНО &Номер
	               |					ИЛИ &Номер = """")";
	Если ЗначениеЗаполнено(Гражданство) Тогда
		Запрос.Текст = Запрос.Текст + "
	               |				И Гражданство = &Гражданство";
	КонецЕсли;	
	Запрос.Текст = Запрос.Текст + ") КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Запрос.УстановитьПараметр("Серия",Серия+"%");
	Запрос.УстановитьПараметр("Номер", Номер+"%");
	Запрос.УстановитьПараметр("Гражданство", Гражданство);  
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	
	ДокументыЗалогодателей.Загрузить(Запрос.Выполнить().Выгрузить()); 
	ПроверитьДействительностьДокументов();
	
	Если ДокументыЗалогодателей.Количество() > 0 Тогда
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	ЛБ_Залогодатели.Ссылка КАК Залогодатель,
	                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК НомерТелефона,
	                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти,
	                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
	                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	                   |ИЗ
	                   |	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
	                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	                   |		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
	                   |ГДЕ
	                   |	ЛБ_Залогодатели.Ссылка В(&Залогодатели)";
		СписокЗ = Новый СписокЗначений;
		Для сч = 0 По ДокументыЗалогодателей.Количество()-1 Цикл
			СписокЗ.Добавить(ДокументыЗалогодателей.Получить(сч).Залогодатель);
		КонецЦикла;	
		Запрос.УстановитьПараметр("Залогодатели", СписокЗ);

		Залогодатели.Загрузить(Запрос.Выполнить().Выгрузить());
		ДокументыЗалогодателей.Сортировать("ОсновнойДУЛ УБЫВ, ВидДокументаЗалогодателя");
		УстановитьТекщиеСтроки();	
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ФамилияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если СтрДлина(Текст) > 2 Тогда
		ФИО = Текст;
        НайтиВозможныеВариантыЗалогодатели();  
	ИначеЕсли СтрДлина(Текст) = 0 Тогда	 
		ФИО = Текст;
		Залогодатели.Очистить();
		ДокументыЗалогодателей.Очистить();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборЗалогодателя();
КонецПроцедуры


&НаКлиенте
Процедура НомерИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если СтрДлина(Текст) > 5 Тогда
		Номер = Текст;
        НайтиВозможныеВариантыДокументы();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыЗалогодателейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	ТекСтрока = Элементы.ДокументыЗалогодателей.ТекущиеДанные;
	Если ТекСтрока.ПроверкаНеДействителен тогда 
		Сообщить("Документ удостоверяющий личность клиента не действителен!", СтатусСообщения.Информация);
		Возврат;
	КонецЕсли;	
	ВыборЗалогодателя();
КонецПроцедуры

&НаКлиенте
Процедура Выбор(Команда)
	ВыборЗалогодателя();
КонецПроцедуры

&НаСервере
Функция ПроверитьПоПеречнюНедружественныхСтран(Гражданство)
	Возврат ЛБ_УправлениеЛомбардом.ПроверитьПоПеречнюНедружественныхСтран(Гражданство);
КонецФункции	

&НаКлиенте
Процедура ВыборЗалогодателя()
	ТекСтрока = Элементы.Залогодатели.ТекущиеДанные; 
	Если ТекСтрока = неопределено тогда
		Возврат;
	КонецЕсли;	
	Если НЕ ТекСтрока.ДатаСмерти = Дата(1,1,1) Тогда
		Сообщить("Дата смерти клиента " + Формат(ТекСтрока.ДатаСмерти, "ДФ=dd.MM.yyyy") + ". Выбор не возможен.");
		Возврат;
	КонецЕсли; 
	
    // ++ Сербаев 20.06.2023
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") Тогда
	    ДатаРожденияЗалогодателя = ВычислитьВозраст(ТекСтрока.ДатаРождения);
		Если ДатаРожденияЗалогодателя < 18 Тогда
		    ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Клиенту %1 %2, выдача займа несовершеннолетним клиентам не осуществляется.", 
			    ДатаРожденияЗалогодателя, ЛБ_ОбщегоНазначения.ОписаниеВозраста(ДатаРожденияЗалогодателя)));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") Тогда
	    ДатаРожденияЗалогодателя = ВычислитьВозраст(ТекСтрока.ДатаРождения);
		Если ДатаРожденияЗалогодателя < 18 Тогда
		    ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Клиенту %1 %2, оплата от несовершеннолетних клиентов не принимается.", 
			    ДатаРожденияЗалогодателя, ЛБ_ОбщегоНазначения.ОписаниеВозраста(ДатаРожденияЗалогодателя)));
			Возврат;
		КонецЕсли;
	КонецЕсли;
    // -- Сербаев 20.06.2023
	
	СтруктураВозврата = Новый Структура("Залогодатель, ДокументЗалогодателя");
	СтруктураВозврата.Вставить("Залогодатель", ТекСтрока.Залогодатель);
	СтруктураВозврата.Вставить("ДатаРождения", ТекСтрока.ДатаРождения);
	
	Если БезДокументов Тогда  
		Этаформа.Закрыть(СтруктураВозврата);
		Возврат;
	КонецЕсли;	
	
	//ТекСтрокаДокументы = Элементы.ДокументыЗалогодателей.ТекущиеДанные;
	//Если НЕ ТекСтрокаДокументы = неопределено Тогда 
	//	Если ТекСтрокаДокументы.ПроверкаНеДействителен тогда 
	//		Сообщить("Документ удостоверяющий личность клиента не действителен!", СтатусСообщения.Информация);
	//		Возврат;
	//	КонецЕсли;	
	//	
	//	Если НЕ ПроверитьПоПеречнюНедружественныхСтран(ТекСтрокаДокументы.Гражданство) Тогда
	//	    СтруктураВозврата.Вставить("ДокументЗалогодателя", ТекСтрокаДокументы.ДокументЗалогодателя);
	//	Иначе
	//		Сообщить("Клиент предъявил документ государства не дружественного по отношению к России. Выдача ссуды по этому документу не возможна.");
	//		Возврат;
	//	КонецЕсли;	 
	//Иначе               
		Отбор = Новый Структура; 
		Отбор.Вставить("Залогодатель", ТекСтрока.Залогодатель);
		Отбор.Вставить("ОсновнойДУЛ", Истина); 		
		Отбор.Вставить("Гражданство", ТекСтрока.Гражданство); 
		
		ВсеОК = Истина;
		СтрокиДУЛ = ДокументыЗалогодателей.НайтиСтроки(Отбор);
		Если НЕ СтрокиДУЛ.Количество() = 0 Тогда 
			ЕстьДокумент = ложь;
			СтрокаДУЛ = СтрокиДУЛ.Получить(0); 
			Если НЕ СтрокаДУЛ.ПроверкаНеДействителен тогда
				Если НЕ СтрокаДУЛ.Гражданство = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда
					Если НЕ ПроверитьПоПеречнюНедружественныхСтран(СтрокаДУЛ.Гражданство) Тогда
					    СтруктураВозврата.Вставить("ДокументЗалогодателя", СтрокаДУЛ.ДокументЗалогодателя); 
						ЕстьДокумент = Истина; 
					Иначе
						Сообщить("Клиент предъявил документ государства не дружественного по отношению к России. Выдача ссуды по этому документу не возможна.");						
					КонецЕсли;  
				Иначе     
					СтруктураВозврата.Вставить("ДокументЗалогодателя", СтрокаДУЛ.ДокументЗалогодателя); 
				    ЕстьДокумент = Истина;	
				КонецЕсли;    
			КонецЕсли;	
			Если НЕ ЕстьДокумент Тогда
				Сообщить("Основной документ удостоверяющий личность клиента по которому возможна выдача займа не найден!", СтатусСообщения.Информация);
		        ВсеОК = ложь;
			КонецЕсли;	
		Иначе
			Сообщить("Основной документ удостоверяющий личность клиента по которому возможна выдача займа не найден!", СтатусСообщения.Информация);
		    ВсеОК = ложь;
		КонецЕсли;
	//КонецЕсли;	
	
	Если ЗначениеЗаполнено(ВидОперации) И НЕ ТекСтрока.Гражданство = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда 
		Если НЕ ПроверитьДокументыПравоПребыванияРФ(ТекСтрока.Залогодатель, ТекСтрока.Гражданство) Тогда
			Сообщить("Не найдены основные документы, подверждающие право клиента на пребывание В РФ!", СтатусСообщения.Информация);
			ВсеОК = ложь;
		КонецЕсли;	
	КонецЕсли;	        
	
	//Если ВсеОК Тогда
	//    Этаформа.Закрыть(СтруктураВозврата); 
	//Иначе     
	//	ЗадатьВопросОткрытьКарточку();
	//КонецЕсли;
	
	//+МАН 16.10.25 Добавлена проверка по перечням
	Если ЗначениеЗаполнено(ВидОперации) И ТекСтрока <> Неопределено Тогда
		ЕстьСовпадение = ПроверитьКлиента(ТекСтрока.Залогодатель);
		Если ЕстьСовпадение Тогда
			ВсеОК = Ложь;
		КонецЕсли;
	КонецЕсли;
	//-МАН
	
	//lion 12.08.2025
	//Доходим до этого момента, что б вышли все сообщения об ошибка для профилактики
	Если Не Этаформа.ЗакрыватьПриВыборе тогда
        ТекущаяСтрока = Элементы.Залогодатели.ТекущиеДанные;
		Если ТекущаяСтрока<>Неопределено тогда
			//ОткрытьЗначение(ТекущаяСтрока.Залогодатель);
			ИзменитьЗалогодателя("");
		КонецЕсли;
	ИначеЕсли ВсеОК Тогда
	    Этаформа.Закрыть(СтруктураВозврата); 
	Иначе     
		ЗадатьВопросОткрытьКарточку();
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Функция ПроверитьКлиента(Залогодатель)
	СтруктураПроверки = ЛБ_ОбщегоНазначения.ПроверитьКлиентаПоПеречням(Залогодатель);

	Возврат СтруктураПроверки.Совпадение;
	
	//Возврат ЛБ_ОбщегоНазначения.ПроверитьКлиентаПоПеречням(Залогодатель);
КонецФункции

&НаКлиенте
Процедура ЗадатьВопросОткрытьКарточку()
    Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", Этаформа); 
    ПоказатьВопрос(Оповещение, "Открыть карточку клиента?", РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да Тогда
        ТекущаяСтрока = Элементы.Залогодатели.ТекущиеДанные;  
		Если ТекущаяСтрока = неопределено Тогда
			Возврат;
		КонецЕсли;
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеИзмененияЗалогодателя",ЭтаФорма);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", ТекущаяСтрока.Залогодатель);
		ПараметрыФормы.Вставить("ПричинаИзменения", ПредопределенноеЗначение("Справочник.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИсправлениеДанныхКонтактнаяИнформация")); 
		ПараметрыФормы.Вставить("ЗакрыватьПриСохранении", Истина);
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьДокументыПравоПребыванияРФ(Клиент, ГражданствоКлиента)
	ЕстьДопДокумент = Ложь;
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("Дата", ДатаДок); 
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Гражданство", ГражданствоКлиента);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен КАК ДокументНеДействителен,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			ДокументЗалогодателя.Владелец = &Клиент
	               |				И Гражданство = &Гражданство
	               |				И ВидДокументаЗалогодателя = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ)
	               |				И ОсновнойДоп = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Если Выборка.ДокументНЕДействителен Тогда
			Продолжить;
		КонецЕсли;	
		Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(ГражданствоКлиента, Выборка.ВидДокументаЗалогодателя, Выборка.ВидДокумента) Тогда
			Если Выборка.ДокументСрокДействия < НачалоДня(ДатаДок) Тогда
				Продолжить;
			КонецЕсли;	
            ЕстьДопДокумент = Истина;
			Прервать;
		Иначе	
			ЕстьДопДокумент = Истина;
			Прервать;
		КонецЕсли;	
	Конеццикла;	  
	Возврат ЕстьДопДокумент;
КонецФункции

&НаКлиенте
Процедура ГражданствоПриИзменении(Элемент)
	//очистим документы с другим гражданством
	Если ЗначениеЗаполнено(Гражданство) Тогда
		УдСтроки = Новый СписокЗначений;
		Для каждого Стр Из ДокументыЗалогодателей Цикл
			Если НЕ Стр.Гражданство = Гражданство Тогда
				УдСтроки.Добавить(Стр);
			КонецЕсли;	
		КонецЦикла;	
		Для каждого Эл Из УдСтроки Цикл
			ДокументыЗалогодателей.Удалить(эл.Значение);
		КонецЦикла;	
		ТекущаяСтрока = Элементы.Залогодатели.ТекущиеДанные;
		Если НЕ ТекущаяСтрока = неопределено Тогда
		    ПерезаполнитьИнформациюПоДокументамЗалогодателя(ТекущаяСтрока.Залогодатель);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьИнформациюПоДокументамЗалогодателя(Залогодатель)
	ДокументыЗалогодателей.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец КАК Залогодатель,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК Серия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ КАК ОсновнойДУЛ,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен КАК ПроверкаНеДействителен
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			ДокументЗалогодателя.Владелец = &Залогодатель
	               |				И ВидДокументаЗалогодателя = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность)) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Гражданство) И НЕ (Гражданство = Выборка.Гражданство) Тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтр = ДокументыЗалогодателей.Добавить();
		НоваяСтр.Залогодатель = Выборка.Залогодатель;
		НоваяСтр.ВидДокумента = Выборка.ВидДокумента;
		НоваяСтр.ВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;	//+++ Моисеев 20250603 почему этого не было?!
		НоваяСтр.ДокументЗалогодателя = Выборка.ДокументЗалогодателя;
		НоваяСтр.Серия = Выборка.Серия;
		НоваяСтр.Номер = Выборка.Номер;
		НоваяСтр.Гражданство = Выборка.Гражданство;
		НоваяСтр.ОсновнойДУЛ = Выборка.ОсновнойДУЛ; 
		НоваяСтр.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи; 
		НоваяСтр.ДокументСрокДействия = Выборка.ДокументСрокДействия;
		НоваяСтр.ПроверкаНеДействителен = Выборка.ПроверкаНеДействителен;
	КонецЦикла;	   
	ПроверитьДействительностьДокументов();
	ДокументыЗалогодателей.Сортировать("ОсновнойДУЛ УБЫВ");
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеИзмененияЗалогодателя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	Если НаТекущуюДату Тогда
	    ДатаДок = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли;	
	ТекущаяСтрока = Элементы.Залогодатели.ТекущиеДанные; 
	Если ТекущаяСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	//проверим снятие блокировки с конт. информации клиента
	Пока Истина Цикл
		Если НЕ ПроверитьБлокировкуКлиента(Результат.Залогодатель) Тогда    
			ДатаДок = ОбщегоНазначенияКлиент.ДатаСеанса();
			Прервать;
		КонецЕсли;	
	Конеццикла;

	ТекущаяСтрока.Залогодатель = Результат.Залогодатель;
	ТекущаяСтрока.НомерТелефона = Результат.НомерТелефона; 
	ТекущаяСтрока.ДатаРождения = Результат.ДатаРождения;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Залогодатель", ТекущаяСтрока.Залогодатель);
	
	Строки = ДокументыЗалогодателей.НайтиСтроки(Отбор);
	Для каждого Стр Из Строки Цикл
		ДокументыЗалогодателей.Удалить(Стр);
	КонецЦикла;	

	ПерезаполнитьИнформациюПоДокументамЗалогодателя(ТекущаяСтрока.Залогодатель);
	
	Элементы.ДокументыЗалогодателей.ОтборСтрок = Новый ФиксированнаяСтруктура("Залогодатель", ТекущаяСтрока.Залогодатель);	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗалогодателя(Команда)
	ТекущаяСтрока = Элементы.Залогодатели.ТекущиеДанные;
	Если ТекущаяСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеИзмененияЗалогодателя",ЭтаФорма);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Залогодатель", ТекущаяСтрока.Залогодатель);
	ПараметрыФормы.Вставить("ПричинаИзменения", ПредопределенноеЗначение("Справочник.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИсправлениеДанныхКонтактнаяИнформация")); 
	ПараметрыФормы.Вставить("ЗакрыватьПриСохранении", Истина);
	ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ФИООчистка(Элемент, СтандартнаяОбработка)
	Залогодатели.Очистить();  
	ДокументыЗалогодателей.Очистить();
КонецПроцедуры


// ++ Сербаев 20.06.2023
&НаСервере
Функция ВычислитьВозраст(ДатаРождения)
	Возврат ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
КонецФункции 

&НаКлиенте
Процедура НомерОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если СтрДлина(Текст) > 0 Тогда
		Номер = Текст;
        НайтиВозможныеВариантыДокументы();
    КонецЕсли;
КонецПроцедуры
// -- Сербаев 20.06.2023

//+++ Моисеев 20250513
&НаСервере
Процедура КомандаПоискНаСервере()
	УсловиеОтбораДляЗапроса = "";
	Если ЗначениеЗаполнено(ЭтаФорма.ОтборНомерЗБ) Тогда
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоиск(Команда)
	КомандаПоискНаСервере();
КонецПроцедуры

&НаСервере
Функция КомандаОчиститьПоискНаСервере()
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();
	СписокОбнуленных = Новый СписокЗначений;
	Для Каждого текРеквизит из РеквизитыФормы Цикл 
		Если Лев(текРеквизит.Имя, 5) = "Отбор" Тогда
			текПустоеЗначениеТипа = текРеквизит.ТипЗначения.ПривестиЗначение();
			Если Не ЭтаФорма[текРеквизит.Имя] = текПустоеЗначениеТипа Тогда 
				ЭтаФорма[текРеквизит.Имя] = текПустоеЗначениеТипа; //заполняем отборы пустыми значениями
				СписокОбнуленных.Добавить(текРеквизит.Имя);
			КонецЕсли;
		КонецЕсли;
		//Элементы[текРеквизит.Имя]
	КонецЦикла;
	Возврат СписокОбнуленных;
КонецФункции

&НаКлиенте
Процедура КомандаОчиститьПоиск(Команда)
    СписокОбнуленных = КомандаОчиститьПоискНаСервере();
	Для Каждого ОбнуленныйРеквизит Из СписокОбнуленных цикл
		//Элементы[ОбнуленныйРеквизит.Значение].ТекстРедактирования = "";
		Элементы[ОбнуленныйРеквизит.Значение].ОбновитьТекстРедактирования();
	КонецЦикла;
	Залогодатели.Очистить();
	ДокументыЗалогодателей.Очистить();
	//	ЭтаФорма.ОтборНомерЗБ = "";
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбрезатьПробелыСпецсимволы(ИсходнаяСтрока)
	Результат = СтрЗаменить(ИсходнаяСтрока, " ", "");
	Результат = СтрЗаменить(Результат, ",", "");
	Результат = СтрЗаменить(Результат, ".", "");
	Результат = СтрЗаменить(Результат, "-", "");
	Результат = СтрЗаменить(Результат, "\", "");
	Возврат Результат;
КонецФункции
&НаСервере
//в случае заполнения при редактировании фамилии/имени/отчества/телефона новое значение ещё не успело быть помещено в переменную, поэтому передаём параметром...
Процедура КомандаПоискНовыйНаСервере(ИмяРедактируемогоРеквизита = Неопределено, ТекстРедактируемогоРеквизита = Неопределено)
	имяГруппаОтбора = "Группа" + текущаяГруппаОтбора;
	
	Если имяГруппаОтбора = "ГруппаОтборФИО_ДР" И Не ИмяРедактируемогоРеквизита = Неопределено Тогда
		//проверка заполнения при вводе текста в полях отбора
		Если (Не ЗначениеЗаполнено(ОтборФамилия)
				И Не (ЗначениеЗаполнено(ОтборИмя) И ЗначениеЗаполнено(ОтборОтчество) И ЗначениеЗаполнено(ОтборДР))) Тогда
			//недостаточно отборов для заполнения
			Возврат;
		КонецЕсли;
	КонецЕсли;	
		
	//Залогодатели.ПолучитьЭлементы().Очистить();
	Залогодатели.Очистить();
	ДокументыЗалогодателей.Очистить();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЛБ_Залогодатели.Ссылка КАК Залогодатель,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ВЫБОР
	               |		КОГДА ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА -1
	               |		КОГДА МЕСЯЦ(&ДатаДокумента) < МЕСЯЦ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |			ТОГДА РАЗНОСТЬДАТ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения, &ДатаДокумента, ГОД) - 1
	               |		КОГДА МЕСЯЦ(&ДатаДокумента) > МЕСЯЦ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |			ТОГДА РАЗНОСТЬДАТ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения, &ДатаДокумента, ГОД)
	               |		КОГДА МЕСЯЦ(&ДатаДокумента) = МЕСЯЦ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ДЕНЬ(&ДатаДокумента) < ДЕНЬ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |						ТОГДА РАЗНОСТЬДАТ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения, &ДатаДокумента, ГОД) - 1
	               |					КОГДА ДЕНЬ(&ДатаДокумента) >= ДЕНЬ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |						ТОГДА РАЗНОСТЬДАТ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения, &ДатаДокумента, ГОД)
	               |				КОНЕЦ
	               |	КОНЕЦ КАК ЗалогодательВозраст,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ДокументЗалогодателяВид,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументЗалогодателяСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументЗалогодателяНомер,
				   |	(ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ
				   |		ИЛИ ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДоп) КАК ДУЛ_Основной,
				   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен КАК ДокументНеДействителен,
				   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
				   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК НомерТелефона,
				   |	ЕСТЬNULL(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПервых.ОтветственныйЛомбард.НомерЛомбарда, """") КАК ОтветственныйЛомбард
	               |ИЗ
	               |	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&ДатаДокумента, ) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	               |		ПО (ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец = ЛБ_Залогодатели.Ссылка)
				   |				И ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность)
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&ДатаДокумента, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	               |		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПервых КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПервых
					|		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПервых.Залогодатель = ЛБ_Залогодатели.Ссылка)
	               |ГДЕ
                   |	Истина
				   |	//Отборы
				   |УПОРЯДОЧИТЬ ПО
				   |	ЛБ_Залогодатели.Наименование,
				   |	ДУЛ_Основной УБЫВ";
				   //|	(&флБезОтбораПоФИО
				   //|			ИЛИ ЛБ_Залогодатели.Имя ПОДОБНО """" + &ДопСимволПоискаПоФИО + &Имя + &ДопСимволПоискаПоФИО
				   //|				И ЛБ_Залогодатели.Фамилия ПОДОБНО """" + &ДопСимволПоискаПоФИО + &Фамилия + &ДопСимволПоискаПоФИО
				   //|				И ЛБ_Залогодатели.Отчество ПОДОБНО """" + &ДопСимволПоискаПоФИО + &Отчество + &ДопСимволПоискаПоФИО)";
	Если имяГруппаОтбора = "ГруппаОтборНомерЗБ" Тогда 
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЛБ_ОперацияПоЗалогу.Залогодатель КАК Залогодатель
		               |ПОМЕСТИТЬ ВТ_Залогодатели
		               |ИЗ
		               |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
		               |ГДЕ
		               |	ЛБ_ОперацияПоЗалогу.НомерЗалоговогоБилета = &ОтборНомерЗалоговогоБилета
					   |	И (ЛБ_ОперацияПоЗалогу.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
					   |				ИЛИ ЛБ_ОперацияПоЗалогу.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление))
					   |;
					   |" + ТекстЗапроса;
		Запрос.УстановитьПараметр("ОтборНомерЗалоговогоБилета", ОбрезатьПробелыСпецсимволы(ОтборНомерЗБ));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//Отборы", "И ЛБ_Залогодатели.Ссылка В (выбрать ВТ_Залогодатели.Залогодатель ИЗ ВТ_Залогодатели)");
	ИначеЕсли имяГруппаОтбора = "ГруппаОтборФИО_ДР" Тогда
		дополнительныйТекстОтбора = "";

		Если ЗначениеЗаполнено(ОтборИмя) Тогда 
			дополнительныйТекстОтбора = дополнительныйТекстОтбора + "
			|			И (ЛБ_Залогодатели.Имя ПОДОБНО """" + &ДопСимволПоискаПоФИО + &Имя + ""%"" + &ДопСимволПоискаПоФИО)";
			Запрос.УстановитьПараметр("Имя", ОбрезатьПробелыСпецсимволы(ОтборИмя));	//СтрЗаменить(ОтборИмя, "%", "ЫЫЫ"));
		КонецЕсли;

		Если ЗначениеЗаполнено(ОтборФамилия) Тогда 
			дополнительныйТекстОтбора = дополнительныйТекстОтбора + "
			|			И (ЛБ_Залогодатели.Фамилия ПОДОБНО """" + &ДопСимволПоискаПоФИО + &Фамилия + ""%"" + &ДопСимволПоискаПоФИО)";
			Запрос.УстановитьПараметр("Фамилия", ОбрезатьПробелыСпецсимволы(ОтборФамилия));	//СтрЗаменить(ОтборФамилия, "%", "ЫЫЫ"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтборОтчество) Тогда 
			дополнительныйТекстОтбора = дополнительныйТекстОтбора + "
			|			И (ЛБ_Залогодатели.Отчество ПОДОБНО """" + &ДопСимволПоискаПоФИО + &Отчество + ""%"" + &ДопСимволПоискаПоФИО)";
			Запрос.УстановитьПараметр("Отчество", ОбрезатьПробелыСпецсимволы(ОтборОтчество));	//СтрЗаменить(ОтборОтчество, "%", "ЫЫЫ"));
		КонецЕсли;
		Если ЗначениеЗаполнено(ОтборДР) Тогда 
			дополнительныйТекстОтбора = дополнительныйТекстОтбора + "
			|			И (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения = &ОтборДР)";
			Запрос.УстановитьПараметр("ОтборДР", ОтборДР);	//СтрЗаменить(ОтборИмя, "%", "ЫЫЫ"));
		КонецЕсли;
			
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//Отборы", дополнительныйТекстОтбора);
				   //|			И (ЛБ_Залогодатели.Имя ПОДОБНО """" + &ДопСимволПоискаПоФИО + &Имя + &ДопСимволПоискаПоФИО
				   //|				И ЛБ_Залогодатели.Фамилия ПОДОБНО """" + &ДопСимволПоискаПоФИО + &Фамилия + &ДопСимволПоискаПоФИО
				   //|				И ЛБ_Залогодатели.Отчество ПОДОБНО """" + &ДопСимволПоискаПоФИО + &Отчество + &ДопСимволПоискаПоФИО)");
		//Запрос.УстановитьПараметр("Фамилия", ЭтаФорма.ОтборФамилия);
		//Запрос.УстановитьПараметр("Отчество", ЭтаФорма.ОтборОтчество);
		Запрос.УстановитьПараметр("ДопСимволПоискаПоФИО", "");	//Там "" или "%"
		
	ИначеЕсли имяГруппаОтбора = "ГруппаОтборДокументУдостоверяющийЛичность" Тогда
		дополнительныйТекстОтбора = "И ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер ПОДОБНО """" + &ОтборНомерДокумента + ""%""";
		Запрос.УстановитьПараметр("ОтборНомерДокумента", ОбрезатьПробелыСпецсимволы(ОтборНомерДокумента));
		Если ЗначениеЗаполнено(ОтборСерияДокумента) Тогда 
			дополнительныйТекстОтбора = дополнительныйТекстОтбора + "
			|	И ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия ПОДОБНО """" + &ОтборДокументСерия + ""%""";
			Запрос.УстановитьПараметр("ОтборДокументСерия", ОбрезатьПробелыСпецсимволы(ОтборСерияДокумента));
		КонецЕсли;

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//Отборы", дополнительныйТекстОтбора);
	ИначеЕсли имяГруппаОтбора = "ГруппаОтборНомерТелефона" Тогда 
		дополнительныйТекстОтбора = "И ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон ПОДОБНО """" + &НомерТелефона + ""%""";
		Запрос.УстановитьПараметр("НомерТелефона", СокрЛП(ОтборНомерТелефона));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//Отборы", дополнительныйТекстОтбора);
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДатаДокумента", ТекущаяДата());
	
	//номер ломбарда, где была создана карточка, ищем запросом для каждого залогодателя
	//из-за необходимости получить первый по дате документ так проще и ненамного дольше... 
	ЗапросНомерЛомбардаГдеСозданаКарточкаЗалогодателя = Новый Запрос;
	ЗапросНомерЛомбардаГдеСозданаКарточкаЗалогодателя.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                                              |	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка,
	                                              |	ЛБ_ОперацияПоЗалогу.Дата КАК Дата,
	                                              |	ЛБ_ОперацияПоЗалогу.Залогодатель КАК Залогодатель,
	                                              |	ЛБ_ОперацияПоЗалогу.Ломбард.НомерЛомбарда КАК НомерЛомбарда
	                                              |ИЗ
	                                              |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	                                              |ГДЕ
	                                              |	ЛБ_ОперацияПоЗалогу.Залогодатель = &Залогодатель
	                                              |
	                                              |УПОРЯДОЧИТЬ ПО
	                                              |	Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Запрос.Выполнить().Выгрузить();
	текПользователь = Пользователи.ТекущийПользователь();
	Если текПользователь.ЭтоЛомбард Тогда 
		номерТекущегоЛомбарда = текПользователь.Наименование;
	Иначе
		номерТекущегоЛомбарда = "6"; //как получать?.. (если вход не под ломбардом, а непосредственно)
	КонецЕсли;
	количествоКлиентовСвоегоЛомбарда = 0; //для сохранения порядка при вставке строк...
	Если Результат.Количество() = 0 Тогда 
		текстСообщения = "Клиент по ";
		Если имяГруппаОтбора = "ГруппаОтборНомерЗБ" Тогда
			текстСообщения = текстСообщения + "номеру залогового билета ";
		ИначеЕсли имяГруппаОтбора = "ГруппаОтборФИО_ДР" Тогда 
			текстСообщения = текстСообщения + "ФИО и дате рождения ";
		ИначеЕсли имяГруппаОтбора = "ГруппаОтборДокументУдостоверяющийЛичность" Тогда		
			текстСообщения = текстСообщения + "документу, удостоверяющему личность ";
		ИначеЕсли имяГруппаОтбора = "ГруппаОтборНомерТелефона" Тогда 
			текстСообщения = текстСообщения + "номеру телефона ";
		Иначе
			текстСообщения = текстСообщения + "неизвестным причинам ";
		КонецЕсли;
		текстСообщения = текстСообщения + "не найден.";
		ОбщегоНазначения.СообщитьПользователю(текстСообщения);
	КонецЕсли;
	
	флЭтоПерваяСтрокаДУЛ = Истина;
	текЗалогодатель = Неопределено;
	//Пока Выборка.Следующий() Цикл
	Для Каждого стрРезультат из Результат Цикл
		Если стрРезультат.Залогодатель = текЗалогодатель Тогда
			//это не первая строка ДУЛ для этого залогодателя, выводим подчиненной строкой...
			//пока не выводим, ДУЛ уже в отдельной таблице
			//новСтр = новСтр.ПолучитьЭлементы().Добавить(); 
		Иначе
			текОтветственныйЛомбард = "";
			Если ЗначениеЗаполнено(стрРезультат.ОтветственныйЛомбард) Тогда
				текОтветственныйЛомбард = стрРезультат.ОтветственныйЛомбард;
			Иначе
				ЗапросНомерЛомбардаГдеСозданаКарточкаЗалогодателя.УстановитьПараметр("Залогодатель", стрРезультат.Залогодатель);
				ВыборкаНомерЛомбардаГдеСозданаКарточкаЗалогодателя = ЗапросНомерЛомбардаГдеСозданаКарточкаЗалогодателя.Выполнить().Выбрать();
				Если ВыборкаНомерЛомбардаГдеСозданаКарточкаЗалогодателя.Следующий() Тогда 
					текОтветственныйЛомбард = ВыборкаНомерЛомбардаГдеСозданаКарточкаЗалогодателя.НомерЛомбарда;
				КонецЕсли;
			КонецЕсли;
			//Если ВыборкаНомерЛомбардаГдеСозданаКарточкаЗалогодателя.НомерЛомбарда = номерТекущегоЛомбарда Тогда 
			Если текОтветственныйЛомбард = номерТекущегоЛомбарда Тогда 
				новСтр = Залогодатели.Вставить(количествоКлиентовСвоегоЛомбарда); //добавляем новую строку в начало ТЗ
				количествоКлиентовСвоегоЛомбарда = количествоКлиентовСвоегоЛомбарда + 1;
			Иначе
				новСтр = Залогодатели.Добавить(); //добавляем новую строку в конец ТЗ
			КонецЕсли;
			новСтр.ЗалогодательНомерЛомбардаГдеСозданаКарточка = текОтветственныйЛомбард;	//ВыборкаНомерЛомбардаГдеСозданаКарточкаЗалогодателя.НомерЛомбарда;
			текЗалогодатель = стрРезультат.Залогодатель;
		    
			ЗаполнитьЗначенияСвойств(новСтр, стрРезультат);
		КонецЕсли;
	КонецЦикла;
	Если Залогодатели.Количество() > 0 Тогда 
		//ПерезаполнитьИнформациюПоДокументамЗалогодателя(Залогодатели[0].Залогодатель);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоискНовый(Команда)
	Если ТекущийЭлемент.Родитель.Имя = "ГруппаОтборНомерЗБ" Тогда
		Если Не ЗначениеЗаполнено(ОтборНомерЗБ) Или (Не СтрДлина(СокрЛП(ОтборНомерЗБ)) = 7) Тогда
			Сообщить("Номер ЗБ для отбора должен быть из 7 цифр.");
			Возврат;
		КонецЕсли;
	ИначеЕсли ТекущийЭлемент.Родитель.Имя = "ГруппаОтборФИО_ДР" Тогда
		Если Не ЗначениеЗаполнено(ОтборФамилия) Тогда
			Если Не (ЗначениеЗаполнено(ОтборИмя)
					И ЗначениеЗаполнено(ОтборОтчество)
					И ЗначениеЗаполнено(ОтборДР)) Тогда
				Сообщить("Недостаточно данных отбора.");
				Возврат;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТекущийЭлемент.Родитель.Имя = "ГруппаОтборДокументУдостоверяющийЛичность"	Тогда
		Если Не ЗначениеЗаполнено(ОтборНомерДокумента) Тогда 
			Сообщить("Для отбора по документу, удостоверяющему личность, укажите, как минимум, номер документа.");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	КомандаПоискНовыйНаСервере();//ЭтаФорма.ТекущийЭлемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьПоляОтбораСервер()
	ОтборДР = '00010101';
	ОтборФамилия = "";
	ОтборИмя = "";
	ОтборОтчество = "";
	ОтборНомерТелефона = "+7 (   )        ";
	ОтборСерияДокумента = "";
	ОтборНомерДокумента = "";
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоляОтбора()
	//пока непосредственно. Можно сделать через ПолучитьРеквизиты() и перебор, но это надо вызов сервера делать...
	//пока непосредственно. Можно сделать через ПолучитьРеквизиты() и перебор, но это надо вызов сервера делать...
	//СписокДляОбновленияОтображения = Новый СписокЗначений;
	ОчиститьПоляОтбораСервер();
	ЭтотОбъект.ОтборДР = '00010101';
	Элементы.ОтборДР.ОбновитьТекстРедактирования();
	ЭтотОбъект.ОтборИмя = "";
	Элементы.ОтборИмя.ОбновитьТекстРедактирования();
	ЭтотОбъект.ОтборНомерДокумента = "";
	Элементы.ОтборНомерДокумента.ОбновитьТекстРедактирования();
	ЭтотОбъект.ОтборНомерЗБ = "";
	Элементы.ОтборНомерЗБ.ОбновитьТекстРедактирования();
	ЭтотОбъект.ОтборНомерТелефона = "+7 (   )        ";
	Элементы.ОтборНомерТелефона.ОбновитьТекстРедактирования();
	ЭтотОбъект.ОтборОтчество = "";
	Элементы.ОтборОтчество.ОбновитьТекстРедактирования();
	ЭтотОбъект.ОтборСерияДокумента = "";
	Элементы.ОтборСерияДокумента.ОбновитьТекстРедактирования();
	ЭтотОбъект.ОтборФамилия = "";
	Элементы.ОтборФамилия.ОбновитьТекстРедактирования();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтборНажатие(Элемент)
	//Элементы.ИмяВашейГруппы.Видимость = НЕ Элементы.ИмяВашейГруппы.Видимость
	//Элемент.Имя	"ДекорацияОтборНомерЗБ"	Строка	
	тГруппаОтбор = "Группа" + Сред(Элемент.Имя, 7);
	текВидимость = Элементы[тГруппаОтбор].Видимость;
	Если текВидимость = Истина Тогда 
		//эта группа уже "развернута", ничего не делаем
		Возврат;
	Иначе 
		ОчиститьПоляОтбора();
		//Залогодатели.ПолучитьЭлементы().Очистить();
		Залогодатели.Очистить();
		ДокументыЗалогодателей.Очистить();
		текущаяГруппаОтбора = Сред(Элемент.Имя, 7);	
	КонецЕсли;
	Для Каждого текЭлемент Из Элементы Цикл 
		Если (Не ТипЗнч(текЭлемент) = Тип("ДекорацияФормы")) И (Лев(текЭлемент.Имя, 11) = "ГруппаОтбор") Тогда
			Если текЭлемент.Имя = тГруппаОтбор Тогда 
				текЭлемент.Видимость = Истина;
			Иначе 	
				текЭлемент.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//Если тГруппаОтбор = "ГруппаОтборНомерЗБ" Тогда
	//	Элементы.ОтборНомерЗБ.ОтметкаНезаполненного = Истина;
	//ИначеЕсли тГруппаОтбор = "ГруппаОтборНомерТелефона" Тогда
	//	Элементы.ОтборНомерТелефона.ОтметкаНезаполненного = Истина;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтбораИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	//Залогодатели.ПолучитьЭлементы().Очистить();
	Залогодатели.Очистить();
	ДокументыЗалогодателей.Очистить();
	Если Элемент.Имя = "ОтборНомерЗБ" Тогда 
		Если СтрДлина(СокрЛП(Текст)) = 7 Тогда 
			ЭтаФорма[Элемент.Имя] = Текст;
			//Элементы.ОтборНомерЗБ.ОтметкаНезаполненного = Ложь;
			Элементы.ОтборНомерЗБ.ЦветФона = WebЦвета.БледноЗеленый;
			КомандаПоискНовыйНаСервере(Элемент.Имя, Текст);
		Иначе 
			//Элементы.ОтборНомерЗБ.ОтметкаНезаполненного = Истина;
			Элементы.ОтборНомерЗБ.ЦветФона = WebЦвета.СветлоРозовый;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЭтаФорма[Элемент.Имя]) = Тип("Дата") Тогда 
		Если Текст = "  .  .    " Тогда
			//пустая строка
			ЭтаФорма[Элемент.Имя] = '00010101';
			КомандаПоискНовыйНаСервере(Элемент.Имя, Текст);
			
		ИначеЕсли СтрДлина(СокрЛП(Текст)) < 10 Тогда
			//вводится дата, но введена ещё не полностью
			СтандартнаяОбработка = Ложь;
			//Возврат;
		Иначе
			ЭтаФорма[Элемент.Имя] = Дата(Текст + " 00:00:00");
			КомандаПоискНовыйНаСервере(Элемент.Имя, Текст);
		КонецЕсли;	
	Иначе
		ЭтаФорма[Элемент.Имя] = Текст;
		Если СтрДлина(Текст) > 2 Тогда 
			КомандаПоискНовыйНаСервере(Элемент.Имя, Текст);
		ИначеЕсли Элемент.Имя = "ОтборСерияДокумента" И СтрДлина(Текст) = 2 Тогда
			КомандаПоискНовыйНаСервере(Элемент.Имя, Текст);
		КонецЕсли;
	КонецЕсли;	
	//ИначеЕсли Элемент.Имя =	"ОтборНомерЗБ" И СтрДлина(Текст) = 7 Тогда 
	//		ЭтаФорма[Элемент.Имя] = Текст;
	//		КомандаПоискНовыйНаСервере(Элемент.Имя, Текст);
	//КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПолеОтбораОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если ТипЗнч(ЭтаФорма[Элемент.Имя]) = Тип("Дата") Тогда 
		Если СтрДлина(СокрЛП(Текст)) < 10 Тогда
			//вводится дата, но введена ещё не полностью
			//СтандартнаяОбработка = Ложь;
			//Возврат;
		Иначе
			ЭтаФорма[Элемент.Имя] = Дата(Текст + " 00:00:00");
			КомандаПоискНовыйНаСервере(Элемент.Имя, Текст);
		КонецЕсли;	
	Иначе		
		Если СтрДлина(Текст) > 2 Тогда 
			ЭтаФорма[Элемент.Имя] = Текст;
			КомандаПоискНовыйНаСервере(Элемент.Имя, Текст);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОтборНомерТелефонаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	//Залогодатели.ПолучитьЭлементы().Очистить();
	Залогодатели.Очистить();
	ДокументыЗалогодателей.Очистить();
	Если СокрЛП(Текст) = "+7 (   )" Тогда
		Возврат;
	КонецЕсли;	
	СтандартнаяОбработка = ложь; 
	ПерваяЦифра = Сред(Текст, 5, 1);
	Если НЕ Перваяцифра = "9" Тогда 
		ЭтотОбъект.ОтборНомерТелефона = Сред(Текст, 1, 4) + "9" + Сред(Текст, 6);
//		Элемент.ТекстРедактирования = Сред(Элемент.ТекстРедактирования, 1, 4) + "9" + Сред(Элемент.ТекстРедактирования, 6);
		ТекстСообщения = "Телефон должен начинаться с 9 и содержать 10 цифр"; 
		Предупреждение(ТекстСообщения, 10);
		Возврат;
	КонецЕсли;
	Если СтрДлина(СокрЛП(Текст)) = 16 тогда
		ПолеОтбораИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка);
		Элементы.ОтборНомерТелефона.ЦветФона = WebЦвета.БледноЗеленый;
	Иначе 
		Элементы.ОтборНомерТелефона.ЦветФона = WebЦвета.СветлоРозовый;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСменаОтбора(Команда)
	ДекорацияОтборНажатие(ТекущийЭлемент);// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтборДРОчистка(Элемент, СтандартнаяОбработка)
	//Залогодатели.ПолучитьЭлементы().Очистить();
	Залогодатели.Очистить();
	ДокументыЗалогодателей.Очистить();
	ЭтаФорма[Элемент.Имя] = '00010101';
	КомандаПоискНовыйНаСервере(Элемент.Имя, "");
КонецПроцедуры

//+++ МоисеевЕС 20250528
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Text", "");
	//
	//ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(
	//	Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ГруппыПрав.НастройкаРодителя");
	//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.ПравоеЗначение = Ложь;
	
	//Элементы.ОтборНомерЗБ.ОтметкаНезаполненного = Истина;
КонецПроцедуры
//--- МоисеевЕС 20250528
